#+TITLE: Clojure 吸血鬼猎杀实战：从 defrecord 到 STM
#+AUTHOR: lujun9972, Claude Code
#+TAGS: clojure, programming, fp
#+DATE: [2026-04-23 Wed]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

学一门新语言最好的方式是写一个完整的程序，哪怕是个小到不能再小的程序。Carin Meier 在 2011 年写了两篇用"吸血鬼猎杀"来教 Clojure 的文章[fn:1][fn:2]——用 =defrecord= 定义角色，用 =assoc= 做不可变更新，用 =recur= 递归击杀，用 =pmap= 并行战斗，最后用 =Atom= （软件事务内存）让吸血鬼真正"死透"。本文是对这两篇文章的解读和代码验证。

* 用 defrecord 创建角色

=defrecord= 是 Clojure 中定义数据类型的方式。跟 Java 的 class 不同， =defrecord= 创建的是不可变（immutable）的数据结构——一旦创建就不能修改，只能生成新的副本。

先定义吸血鬼。每只吸血鬼有两个属性：名字和血量（health points）。血量降到 0 就是灰飞烟灭了。

#+begin_src clojure
(defrecord Vampire [name health])
#+end_src

#+RESULTS:
: user.Vampire

然后用 =Vampire.= （注意末尾的点，这是 Clojure 调用 Java 构造函数的语法）创建一只叫 Stu 的吸血鬼，血量 50：

#+begin_src clojure
(def vampire1 (Vampire. "Stu" 50))
#+end_src

#+RESULTS:
: #'user/vampire1

在 REPL 中查看它的值，你会看到一个类似 map 的结构：

#+begin_src clojure
vampire1
#+end_src

#+RESULTS:
: #user.Vampire{:name "Stu", :health 50}

#+begin_example
#:user.Vampire{:name "Stu", :health 50}
#+end_example

=defrecord= 生成的类型自动支持用关键字当函数来取值。

Clojure 中的*关键字*（keyword）是以冒号开头的标识符，如 =:name= 、 =:health= 。关键字跟字符串或符号不同，它求值的结果就是它自己。关键字有一个特殊能力：它可以当函数用——当关键字后面跟一个 map 或 record 时，它会在这个结构中查找跟自己同名的键，返回对应的值。所以 =(:name vampire1)= 等价于"在 vampire1 中查找 =:name= 这个键"，结果是 ="Stu"= 。这比 Java 的 =getName()= 简洁得多，但本质一样——都是访问字段。

#+begin_src clojure
(:name vampire1)
#+end_src

#+begin_example
"Stu"
#+end_example

#+begin_src clojure
(:health vampire1)
#+end_src

#+begin_example
50
#+end_example

多创建几只吸血鬼，后面要用：

#+begin_src clojure
(def vampire1 (Vampire. "Stu" 50))
(def vampire2 (Vampire. "Vance" 100))
(def vampire3 (Vampire. "Izzy" 75))
#+end_src

然后是猎人。猎人也有名字和武器，武器用一个数字表示伤害值。Buffy 决定赤手空拳上阵，她的功夫值 25 点伤害：

#+begin_src clojure
(defrecord Slayer [name weapon])
(def kungfu 25)
(def buffy (Slayer. "Buffy" kungfu))
#+end_src


* 用 recur 递归击杀

一次攻击不够，猎人需要反复攻击直到吸血鬼血量归零。Clojure 不用普通的递归（会消耗栈空间），而是用 =recur= 做尾递归优化——每次递归调用不会增加调用栈，而是直接跳回函数开头继续执行，性能等价于循环。

#+begin_src clojure
(def combat-time 20)

(defn hit-vampire [vampire slayer]
  (Thread/sleep (* combat-time 10))
  (assoc vampire :health (hit vampire (:weapon slayer))))
#+end_src

这里加了 =Thread/sleep= 来模拟战斗耗时——每次攻击需要 200 毫秒（combat-time 20 × 10）。

然后用 =recur= 实现递归击杀：如果血量大于 1，就再打一次；否则把血量设为 0 返回：

#+begin_src clojure
(defn kill-vampire [vampire slayer]
  (if (> (:health vampire) 0)
    (recur (hit-vampire vampire slayer) slayer)
    (assoc vampire :health 0)))
#+end_src

#+RESULTS:
: #'user/kill-vampire

Buffy 用功夫（25 点伤害）杀 Stu（50 血量），需要打 2 次，耗时约 400 毫秒：

#+begin_src clojure
(time (kill-vampire vampire1 buffy))
#+end_src

#+begin_example
"Elapsed time: 400.542595 msecs"
#:user.Vampire{:name "Stu", :health 0}
#+end_example

Vance 有 100 血量，需要打 4 次，耗时约 800 毫秒：

#+begin_src clojure
(time (kill-vampire vampire2 buffy))
#+end_src

#+begin_example
"Elapsed time: 801.318529 msecs"
#:user.Vampire{:name "Vance", :health 0}
#+end_example

如果给 Buffy 换上圣水（100 点伤害），杀 Vance 只需 1 次，200 毫秒就够了：

#+begin_src clojure
(def holy-water 100)
(def buffy (Slayer. "Buffy" holy-water))

(time (kill-vampire vampire2 buffy))
#+end_src

#+begin_example
"Elapsed time: 200.247375 msecs"
#:user.Vampire{:name "Vance", :health 0}
#+end_example

